Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData.TotalConnectedCurrent
The total connected current of the electrical analytical transfer switch.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData.CurrentRating
The current rating value of the electrical analytical transfer switch.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for rating is not a number
-or-
When setting this property: The given value for rating is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for rating must be non-negative.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData.Voltage
The voltage value of the electrical analytical transfer switch.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for voltage is not a number
-or-
When setting this property: The given value for voltage is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for voltage must be positive.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData
Represents the data and parameters of electrical analytical transfer switch.
Since:
2023